In [1]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
url = r'https://raw.githubusercontent.com/panda-kim/pandas/main/ch04.csv'

In [11]:
df_ex_1 = pd.read_csv(url)
df_ex_1.head()

    이름  점수
0  노성빈  22
1  문주용  52
2  최태주  71
3  황혁범  53
4  서석훈  22

In [5]:
df_ex_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      100 non-null    object
 1   점수      100 non-null    int64
dtypes: int64(1), object(1)
memory usage: 1.7+ KB

In [7]:
df_ex_1.describe()

               점수
count  100.000000
mean    50.890000
std     18.143588
min     20.000000
25%     35.750000
50%     50.500000
75%     65.500000
max     79.000000

In [22]:
df_ex_1['순위'] = df_ex_1['점수'].rank(method='min', ascending=False).astype('int')
df_ex_1.sort_values(by='순위')

     이름  점수   순위
37  민일택  79    1
35  구은탁  79    1
93  문지용  79    1
38  임영찬  78    4
61  백승수  78    4
..  ...  ..  ...
4   서석훈  22   94
54  이동범  22   94
20  유성환  21   98
16  심진웅  21   98
12  구우진  20  100

[100 rows x 3 columns]

In [23]:
df_ex_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      100 non-null    object
 1   점수      100 non-null    int64
 2   순위      100 non-null    int32
dtypes: int32(1), int64(1), object(1)
memory usage: 2.1+ KB

In [24]:
df_ex_1['순위'] = df_ex_1['순위'].astype('int')
df_ex_1.head()

    이름  점수  순위
0  노성빈  22  94
1  문주용  52  49
2  최태주  71  19
3  황혁범  53  47
4  서석훈  22  94

In [25]:
df_ex_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      100 non-null    object
 1   점수      100 non-null    int64
 2   순위      100 non-null    int32
dtypes: int32(1), int64(1), object(1)
memory usage: 2.1+ KB

In [26]:
df_ex_1[df_ex_1['순위']==1]

     이름  점수  순위
35  구은탁  79   1
37  민일택  79   1
93  문지용  79   1

In [28]:
df_ex_1.loc[df_ex_1['순위']==1, ['이름','점수']]

     이름  점수
35  구은탁  79
37  민일택  79
93  문지용  79

In [29]:
df_ex_1[df_ex_1.점수 > 40]

     이름  점수  순위
1   문주용  52  49
2   최태주  71  19
3   황혁범  53  47
5   주기원  44  63
8   유지홍  65  26
..  ...  ..  ..
93  문지용  79   1
94  양호근  58  39
95  차지우  61  30
98  류형석  41  69
99  유남길  67  24

[70 rows x 3 columns]

In [30]:
df_ex_1

     이름  점수  순위
0   노성빈  22  94
1   문주용  52  49
2   최태주  71  19
3   황혁범  53  47
4   서석훈  22  94
..  ...  ..  ..
95  차지우  61  30
96  신민기  22  94
97  지도훈  24  90
98  류형석  41  69
99  유남길  67  24

[100 rows x 3 columns]

In [31]:
cond1 = df_ex_1.점수 > 40
df_ex_1['비고'] = df_ex_1.점수.mask(cond1, '패스').mask(~cond1,'낙제')
df_ex_1

     이름  점수  순위  비고
0   노성빈  22  94  낙제
1   문주용  52  49  패스
2   최태주  71  19  패스
3   황혁범  53  47  패스
4   서석훈  22  94  낙제
..  ...  ..  ..  ..
95  차지우  61  30  패스
96  신민기  22  94  낙제
97  지도훈  24  90  낙제
98  류형석  41  69  패스
99  유남길  67  24  패스

[100 rows x 4 columns]

In [32]:
df_ex_1['학점'] = pd.cut(df_ex_1.점수, bins=[0,40,50,60,70,80], labels=['F', 'D', 'C', 'B', 'A'])
df_ex_1.head()

    이름  점수  순위  비고 학점
0  노성빈  22  94  낙제  F
1  문주용  52  49  패스  C
2  최태주  71  19  패스  A
3  황혁범  53  47  패스  C
4  서석훈  22  94  낙제  F